
[{
  "id": "safe_arrival",
  "title": "Safe Arrival and Dismissal Policy and Procedures",
  "content": "Safe Arrival and Dismissal Policy and Procedures\nPurpose\nThis policy and the procedures within help support the safe arrival and dismissal of children receiving care at Central Montessori School. This policy will provide staff, students and volunteers with a clear understanding of their roles and responsibilities for ensuring the safe arrival and dismissal of children receiving care, including what steps are to be taken when a child does not arrive at the childcare centre as expected, as well as steps to follow to ensure the safe dismissal of children. This policy is intended to fulfill the obligations set out under Ontario Regulation 137/15 for policies and procedures regarding the safe arrival and dismissal of children in care.\n\nPolicy\nGeneral\nCentral Montessori School will ensure that any child receiving child care is only released to the child's parent/guardian, or an individual that the parent/guardian has provided written authorization allowing the child care centre to release the child. Central Montessori School will only dismiss children into the care of their parent/guardian or another authorized individual. The centre will not release any children from care without supervision. When a child does not arrive in care as expected or is not picked up as expected, staff must follow the safe arrival and dismissal procedures set out below.\n\nPolicy Statements\nProcedure:\nChildren will only be released to adults who are permitted by the parents and listed on the child's file or if written consent has been provided.\n\nAccepting a child into care\nWhen accepting a child into care at the time of drop-off, program staff in the room must:\nGreet the parent/guardian and child.\nWhere the parent/guardian indicates that someone other than the child's parent/guardians will be picking up, the staff must confirm that the person is listed on the student pick-up list on the child's file or, where the individual is not listed, ask the parent/guardian to provide authorization for pick-up in writing (e.g., note or email).\nDocument the change in the pick-up procedure in the daily written record.\nSign the child in on the classroom attendance record.\n\nWhere a child has not arrived in care as expected\nWhere a child does not arrive at the Central Montessori School, and the parent/guardian has not communicated a change in drop-off (e.g., left a voice message or advised the closing staff at pick-up), the staff in the classroom must:\nInform the supervisor/designee. The staff must commence contacting the child's parent/guardian no later than 10:00 am, and leave a message if there is no response. If no response is received after/within 4 hours, the staff will report to the supervisor/designee.\nThe supervisor/designee will contact the emergency person listed on file.\nOnce the child's absence has been confirmed, program staff shall document the child's absence on the attendance record and any additional information about the child's absence in the daily written record.\n\nReleasing a child from care\nThe staff who is supervising the child at the time of pick-up shall only release the child to the child's parent/guardian or an individual that the parent/guardian has provided written authorization for. Where the staff does not know the individual picking up the child (i.e., parent/guardian or authorized individual), they must:\nConfirm with another staff member that the individual is the child's parent/guardian/authorized pick-up.\nWhere the above is not possible, ask the parent/guardian/authorized individual for photo identification and confirm the individual's identity against the information on the child's file or written authorization. A copy of the identification will be kept in the child's file.\n\nWhere a child has not been picked up as expected (before the centre closes)\nWhere a parent/guardian has communicated a specific time or time frame for pick-up and the child has not been picked up at that time, the staff/supervisor/designee will call the parent/guardian to advise that the child is still in care and has not been picked up.\nWhere staff is unable to reach the parent/guardian, staff must leave a message. If staff does not hear from the parent/guardian after 15 minutes, the emergency contact listed on the child's file will be contacted. Where an authorized individual is responsible for pick-up and their contact information is available, staff shall contact them to confirm pick-up or leave a voicemail.\nIf no response is received from the parent/guardian or authorized individual, staff shall wait until program close (6 pm) and then follow procedures under \"where a child has not been picked up and the program is closed\".\n\nWhere a child has not been picked up and the centre is closed\nWhere a parent/guardian or authorized individual was scheduled to pick up the child and has not arrived by 6 pm, staff shall ensure that the child is provided a snack and activity. One staff will stay with the child while another attempts to contact the parent/guardian to advise they are still in care.\nIf the staff is unable to reach the parent/guardian, they will proceed to call the authorized individual. If unsuccessful, they will then call the emergency contact listed in the child's file.\nWhere staff is unable to reach any parent/guardian or authorized individual (including emergency contacts) by 7 pm, staff shall contact the local Children's Aid Society (CAS) at 416-924-4646 and follow CAS direction.\n\nDismissing a child from care without supervision procedure\nStaff will only release children to the parent/guardian or other authorized adult. Under no circumstances will children be released to walk home alone.\n\nThe policy will be reviewed by the staff, students and volunteers before they begin their employment at CMS, and annually thereafter or at any time a revision occurs. A record of this review will be signed and dated by the person who participated and conducted the review. This record will be maintained for a minimum of 3 years.\n\nDate: Policy and Procedures Established: January 1, 2024\nDate: Policy and Procedures Updated: January 8, 2024",
  "keywords": [
    "safe arrival",
    "dismissal",
    "child not arriving",
    "child not picked up",
    "authorized pick up",
    "identification check",
    "10:00 am",
    "6 pm closing",
    "7 pm CAS",
    "emergency contact",
    "written authorization",
    "attendance record",
    "drop-off procedures",
    "pick-up procedures"
  ]
},

  {
  "id": "sleep_toddlers",
  "title": "Sleep Supervision Policy and Procedures (Toddler & Preschool)",
  "content": "The Sleep Supervision Policy and Procedures (Toddler & Preschool)\nThe CMS Sleep Supervision Policy’s intent is to reduce the risk of harm or injury when children are sleeping. Parents/Guardians of children who regularly sleep at the center will be initially consulted with respect to their child’s sleeping arrangements, sleeping preferences, precautions and required accommodations at the time of enrollment and at any time changes might be required, such as during transitions between programs/room, or when changes are requested by parents. Special sleeping instruction will be recorded on a child’s application annually or as changes are required thereafter. Staff will be informed of a child’s sleeping arrangements by the office upon initial registration, annually thereafter, or when changes are requested or made. Significant changes in a child’s sleeping patterns or behaviours will be immediately communicated with parents as they arise verbally or through the daily communicable book.\n\nGeneral Procedures:\nChildren are assigned to individual cots labelled with the child’s name and class number/name to identify which children are present in the area or room.\n\nCots comply with the standards in the regulations made under the Canada Consumer Product Safety Act.\n\nParents will be consulted at the time of enrollment with respect to a child’s sleeping arrangements.\n\nThere must be sufficient light in the sleeping area or room to conduct direct visual checks of children through the use of lamps or leaving blinds open (as required).\n\nStaff must perform a direct visual check of all sleeping children every 30 minutes by being physically present beside the child while the child is sleeping and looking for indicators of distress or unusual behaviours such as: changes in the colour of the skin, breathing patterns, signs of overheating, etc. Staff will document the direct visual checks being conducted on every child’s sleep tracking sheet.\n\nThe observance of any significant changes in a child’s sleeping patterns or behaviours during sleep will be tracked and communicated to parents verbally. This might result in adjustments to the manner in which the child is supervised during sleep and details regarding the performance of direct visual checks and how frequently direct visual checks will be performed.\n\nSystem to identify the use of Sleep Room:\n\nStaff are required to record sleeping children’s name in their daily log book and ensure that the time of their return to the classroom is logged to ensure children are accounted for at all times, whether in the sleep room or in the classroom.\n\nThis policy will be reviewed by staff, students and volunteers before they begin their employment at CMS, and annually thereafter, or at any time a revision occurs. A record of this review will be signed and dated by the person who participated and conducted the review and will be kept for a minimum of 3 years.",
  "keywords": [
    "toddler sleep",
    "preschool sleep",
    "cot",
    "sleep supervision",
    "30 minute checks",
    "sleep tracking sheet",
    "sleep room",
    "visual checks",
    "sleep arrangements",
    "parent consultation",
    "daily log"
  ]
},
  {
  "id": "serious_occurrence",
  "title": "Serious Occurrence Policy",
  "content": "Serious occurrences must be reported to the Ministry as defined under the Child Care and Early Years Act. These include: the death of a child, abuse or alleged abuse, life-threatening injury or illness, a missing or temporarily unsupervised child, and any unplanned disruption to operations that creates a risk to health or safety. Staff must respond immediately depending on the situation: call 911 for death, life-threatening injury, illness, fire, gas leak, carbon monoxide, or lockdown; call CAS for allegations of abuse or neglect; contact Toronto Public Health during outbreaks; contact City services for flood (311). Serious Occurrences must be reported through CCLS within 24 hours, and the Program Advisor must also be notified within 24 hours. A Serious Occurrence Notification Form must be posted for a minimum of 10 business days, protecting all personal information (no names, initials, ages, or room identifiers). An internal inquiry must begin immediately, collecting details including description, allegation, date/time, reason, people involved, actions taken, and current status. If abuse is suspected, CAS must be contacted by the person with reasonable grounds. Supervisors conduct an annual analysis of all serious occurrences and maintain records for 3 years. Employers must report RECE incidents involving misconduct, suspension, termination, or resignation under investigation to the College of ECE within 30 days.\n\nDEFINITION: Serious occurrences to be reported by CMS to the ministry are defined as follows in the Child Care and Early Years Act: The death of a child who received child care at the child care centre, whether it occurs on or off premises; Abuse, neglect or an allegation of abuse or neglect of a child while receiving child care at the centre; A life-threatening injury to or a life-threatening illness of a child who receives child care at the centre; An incident where a child who is receiving child care at the centre goes missing or is temporarily unsupervised; or An unplanned disruption of the normal operations of a child care centre that poses a risk to the health, safety or well-being or children receiving child care at the centre. Note: Within the parameters of the preceding definitions, Central Montessori School is responsible for determining whether an incident is deemed to be a serious occurrence as defined by these procedures, and whether it should be reported to the ministry.\n\nRESPONDING TO A SERIOUS OCCURRENCE: Death of a child: 911. Allegation of Abuse and/or Neglect: Children's Aid Society (CAS) 416-924-4646. Ministry Program Advisor. Life-threatening Injury or Illness: Injury: 911. Illness: 911 & Toronto Public Health. Missing or Unsupervised Child: 911 Police Department - CAS - Ministry Program Advisor. Unplanned Disruption of Normal Operations: Fire – 911 Fire Department. Flood – 311 City of Toronto. Gas Leak – 911 Direct Energy 1-866-763-5427. Detection of Carbon Monoxide – 911 City of Toronto 311. Outbreak – Toronto Public Health 416-338-7600. Lockdown – 911. Other Emergency Relocation or Temporary Closure – 911 Ministry Program Advisor (through CCLS) Toronto Public Health 416-338-7600.\n\nREPORTING PROCEDURES: A Serious Occurrence must be reported online using the Child Care Licensing Information System (CCLS) within 24 hours. Any other occurrence to be deemed serious must be reported within 24 hours. As of Oct. 1st, 2016, it is no longer required to report serious occurrences to the City of Toronto. Reports will automatically be forwarded to Children Services. The report must be provided to the program advisor within 24 hours via telephone or email.\n\nSERIOUS OCCURRENCE NOTIFICATION FORM: Following submission of the Serious Occurrences on CCLS, the operator will print out a Serious Occurrence Notification Form to communicate information to parents. The form will be posted near the Child Care Licence and Licensing Summary Chart for a minimum of 10 business days. Updates restart the 10-day period. Personal information must not be included (names, initials, ages, birth dates, room identifiers).\n\nACTIONS TO BE TAKEN: The child shall receive immediate medical attention if needed. Address any continuing risks. Notify the coroner immediately in all cases involving death. Witnesses must report information to the designated person. The supervisor must begin an inquiry immediately. All persons with knowledge of the occurrence must remain available until interviewed. Inquiry details should include: description, allegations, date/time, reason, people involved, actions taken, status, coroner info, further recommendations (police, CAS, parents, others). If there is reasonable suspicion of abuse, CAS must be contacted by the person who suspects it. If alleged abuse occurred at CMS, CAS and the Program Advisor must be notified. If the supervisor is absent, the administrator reports; if both are absent, the Head of School reports.\n\nANNUAL ANALYSIS: Completed by Supervisor. Used to identify issues, trends, and actions. Records kept for 3 years. Policy reviewed annually and stored securely for 3 years.\n\nEMPLOYER’S MANDATORY REPORTING: Employers must report to the College of Early Childhood Educators if an RECE is terminated, suspended, restricted, or resigns under investigation. Reports of misconduct must be submitted within 30 days, including the Serious Occurrence report.",
  "keywords": [
    "serious occurrence",
    "CCLS",
    "reporting",
    "24 hours",
    "Program Advisor",
    "notification form",
    "CAS",
    "police",
    "Toronto Public Health",
    "life-threatening injury",
    "missing child",
    "abuse or neglect",
    "inquiry",
    "annual analysis",
    "privacy requirements",
    "RECE mandatory report"
  ]
},
  {
  "id": "sleep_infants",
  "title": "Sleep Supervision Policy and Procedures (Infants)",
  "content":"The Sleep Supervision Policy and Procedures (Infants)\nThe purpose of this policy and procedures is to reduce the risk of harm and injury, including death, when infants are sleeping. CMS will ensure that children younger than 12 months of age are placed for sleep in a manner consistent with the recommendation as set out in the Public Health’s “Joint Statement on Safe Sleep: Preventing Sudden Infant Deaths in Canada.”\n\nNote: The current recommendation set out in the most current version of the Joint Statement on Safe Sleep: Preventing Sudden Infant Deaths in Canada is that children up to their first birthday be placed on their backs for sleep. This requirement can only be waived if a medical doctor/physician recommends otherwise in writing. Once infants are able to roll from their backs to their stomachs or sides, it is not necessary to reposition them onto their backs.\n\nProcedure:\nChildren are assigned to individual cribs labelled with their name and a picture card placed above their crib to immediately identify which children are present in the area or room.\n\nCribs comply with the standards in the regulations made under the Canada Consumer Product Safety Act. A document will be completed for each crib in the infant room and filed in a secure location with the make, model number and the year it was produced.\n\nAnnual checks will be conducted and documented to confirm that the cribs meet the standards as set out in the Public Health Agency of Canada’s Joint Statement on Safe Sleep. This document will be filed and maintained at CMS for three years.\n\nParents are consulted with respect to a child’s sleeping arrangement verbally at the time of enrollment, and at any time changes might be required, such as during transitions between programs/room, or when changes are requested by parents. Parents will also be advised that children 12 months and younger will be placed on their backs for sleep in accordance with the Joint Statement on Safe Sleep. CMS shall adhere to these recommendations unless a child’s physician recommends otherwise in writing regarding alternate sleep positions. This information is transferred to the “sleep card” placed over the child’s crib and reviewed by staff in the infant room.\n\nParents will be consulted before an infant is transitioned to the toddler room and will receive a consent letter to approve the transition of their child from an infant crib to a cot for nap time. This letter will be signed and dated by the parents and staff and placed in the child’s file.\n\nInfants are safest when placed to sleep in fitted one-piece sleepwear comfortable at room temperature to reduce the risk of overheating and minimize the use of blankets. If a blanket is used, it must be breathable. No extra items such as pillows, duvets, or bumper pads may be placed in the crib.\n\nThere must be sufficient light in the sleeping area or room to conduct direct visual checks of children through the use of lamps or leaving blinds open.\n\nStaff must perform a direct visual check of all sleeping children every 15 minutes by being physically present beside the child and looking for indicators of distress or unusual behaviours such as changes in skin colour, breathing patterns, or signs of overheating. Staff will document direct visual checks on each child’s sleep tracking sheet.\n\nThe observance of any significant changes in a child’s sleeping patterns or behaviours during sleep will be tracked and communicated to parents either verbally or through daily reports. This may result in adjustments to how the child is supervised during sleep and how frequently direct visual checks are performed.\n\nStrollers, swings, bouncers and car seats are not intended for infant sleep. An infant’s head can fall forward when sleeping in a seated position and cause airway constriction. Once an infant falls asleep, the child should be moved as soon as possible or once at the destination to sleep in a crib.\n\nSystem to identify the use of Sleep Room:\nStaff are required to place the name tag of children sleeping in the sleep room on the door or wall outside the room.\nWhen there are more than 3 infants in the sleep room, one staff member must be physically present inside the sleep room.\n\nElectronic Monitoring Devices:\nElectronic sleep monitoring devices are not used as a replacement for direct visual checks. Staff must still conduct checks according to regulations. Devices must be checked daily to ensure they are functioning properly. The time, date and condition of the device will be documented on the device tracking sheet.\nIf a device is not working, staff shall inform the supervisor for repair or removal.\n\nThis policy will be reviewed by staff, students and volunteers before they begin their employment at CMS, and annually thereafter, or at any time a revision occurs. A record of this review will be signed and dated by the person who participated and will be maintained for a minimum of 3 years in a secure location at CMS.\n\nRE: INFANT–TODDLER SLEEP TRANSITION\n\nCHILD’S NAME: _________________________    D.O.B.: __________________\n\nI, __________________________________, understand that my child is transitioning to the Toddler room and is using a toddler cot during nap time. I understand that while my child is using the cot, the teachers will continue to monitor his/her sleep as set out in the CMS Sleep Supervision Policy for Infants.\n\n__________________________________            ____________________\nParent/Guardian Signature                     Date\n\nRE: INFANT–TODDLER SLEEP TRANSITION\n\nCHILD’S NAME: _________________________    D.O.B.: __________________\n\nI, __________________________________, understand that my child is transitioning to the Toddler room and is using a toddler cot during nap time. I understand that while my child is using the cot, the teachers will continue to monitor his/her sleep as set out in the CMS Sleep Supervision Policy for Infants.\n\n__________________________________            ____________________\nParent/Guardian Signature                     Date",
  "keywords": [
    "infant sleep",
    "sleep supervision",
    "back to sleep",
    "Joint Statement on Safe Sleep",
    "crib safety",
    "Canada Consumer Product Safety Act",
    "15 minute checks",
    "sleep tracking sheet",
    "SIDS",
    "sleep room",
    "monitoring devices",
    "infant transitions",
    "cot transition",
    "safe sleep environment",
    "overheating",
    "visual check",
    "infants under 12 months"
  ],
  "link": "https://docs.google.com/document/d/1HoWGu9GNCalQ4QzIVwtIopinMJC79lNX"
},
  {
    "id": "students_volunteers",
    "title": "Supervision of Students & Volunteers Policy",
    "content":"Supervision of Students & Volunteers Policy\n\nCentral Montessori School supports the education of future professionals through field placements, and volunteers as an additional support and value to our programs.\n\nStudents and volunteers are supervised and function under the direction of qualified CMS staff, and must never be left alone with children or replace a staff member.\n\nExpectations of Students and Volunteers\n\nStudents and Volunteers:\n- must be 18 years or older\n- are never left alone with the children, are not included in staffing ratios, and will be supervised and mentored by a qualified CMS teaching staff member at all times\n- are required to wear identification badges or tags\n- are required to obtain a Vulnerable Sector Check\n- must review and sign the Prohibited Practices Policy, and receive all CMS policies & procedures and existing Individual Support Plans before commencing placement\n- must review and sign the Anaphylaxis Policy and emergency procedures with a CMS supervisor/principal or mentoring staff before commencement of placement\n- must notify their Supervisor/Principal as soon as possible if they are to be absent. Sick individuals should not attend school. If showing signs of fever, vomiting, diarrhea, or communicable diseases (pink eye, chicken pox, etc.), they must stay home until no longer ill or cleared by a doctor\n- are urged to use tact, diplomacy and politeness when dealing with management, parents and teachers. They must use “Mr.” “Mrs.” “Miss” when speaking with the Supervisor/Principal, other staff, and parents. Difficulties should be reported to the Supervisor/Principal immediately\n- must never address parents on a first name basis unless specifically requested by the parent\n- must refer parents to the classroom teacher if asked questions about the child or program\n- shall not have lunch or make private arrangements with parents or children outside of school or during school hours unless approved by the Principal/Head of School\n- shall not use confidential information, photographs, or video of any child or employee for any purpose unless written consent is received from the Head of School/Principal/Supervisor\n- must never give any parent’s or employee’s phone number, address, or other personal information to anyone\n- must not speak in a foreign language in front of children. Only English may be spoken unless language lessons (French, Spanish, etc.) are in progress. All children must be spoken to in English at all times unless otherwise approved\n- must adhere to the appropriate dress code policy\n\nRoles and Responsibilities of Students and Volunteers:\n- General supervised participation and engagement with students during daily activities and planned program\n- Assisting classroom teachers and engaging with students during arts & crafts, science, cooking, etc.\n- Assisting classroom teachers with general classroom management\n- Assisting with general classroom maintenance and cleaning\n- Assisting with lunch routine (set-up, serving, and clean-up with children)\n\nSupervision\n\nThe CMS supervisor/principal is responsible for supervising students and volunteers, and will assign daily supervision and responsibilities to a mentoring teacher.\n\nExpectations of the mentoring teacher:\n- must clearly explain what is expected of the student/volunteer during their placement\n- must treat students/volunteers the same as paid staff, offering equal respect and opportunities for skill development\n- must never leave children unattended with a student/volunteer\n- must not include students/volunteers to uphold ratios\n- must ensure students/volunteers remain in sight while working with children\n- must be able and willing to offer necessary support for a successful placement\n- must introduce students/volunteers to parents\n\nThis policy will be reviewed by staff, students and volunteers before beginning employment/placement at CMS, and annually thereafter or at any time a revision occurs. A record of this review will be signed and dated by participants and kept for a minimum of 3 years.\n\nI __________________________________ AM A STUDENT TEACHER/VOLUNTEER AT CENTRAL MONTESSORI SCHOOL AND MY SIGNATURE BELOW HEREBY ACKNOWLEDGES THAT I HAVE FULLY READ, UNDERSTOOD AND AGREE TO FOLLOW THE STIPULATED GUIDELINES CAREFULLY AND COMPLETELY.\n\nSignature of Student/Volunteer: _____________________________    Date: ___________\n\nWitness: ________________________________________________    Date: ___________",
    "keywords": [
      "student",
      "volunteer",
      "supervision",
      "ratio",
      "Vulnerable Sector Check",
      "policy review",
      "prohibited practices",
      "anaphylaxis",
      "confidentiality",
      "mentoring teacher",
      "identification"
    ]
  },
  {
    "id": "waiting_list",
    "title": "Waiting List Policy & Procedures",
    "content": "Waiting List Policy & Procedures\n\nCentral Montessori Schools (CMS) does not charge or collect a fee for the placement of a child on a school waiting list for admission at any of our locations.\n\nPriority shall be given to transfers from other CMS locations, siblings of existing students, and children of CMS employees.\n\nIn order to be placed on a waiting list, families must provide a completed admission form, signed on the day the child will be placed on the list. All information collected will be private and confidential, only to be used for admission purposes by school administrators. The information on the waiting list will be available in a manner that maintains the privacy of children listed on it, and information will be given to parents/guardians regarding the position of their child on the list upon request. Visible information on other children and their families will be physically concealed (using blank paper to cover the names of others on the list before and after the child in question), but the position of the child being inquired about will be disclosed to parents/guardians.\n\nUpon availability of placement, admission from the waiting list is determined on a first-come, first-served basis according to the date on the application or the day the child was placed on the list.\n\nOnce placement can be secured, a non-refundable, one-time registration fee of $500 is payable to CMS.\n\nThis policy will be reviewed by staff, students and volunteers before they begin their employment at CMS, and annually thereafter, or at any time a revision occurs. A record of this review will be signed and dated by the person who participated and conducted the review and will be kept for a minimum of 3 years.",
    "keywords": [
      "waiting list",
      "admission",
      "priority",
      "siblings",
      "CMS employees",
      "registration fee",
      "privacy",
      "placement",
      "first come first serve"
    ]
  },
  {
    "id": "staff_development",
    "title": "Staff Development & Training Policy",
    "content": "Staff Development and Training Policy\n\nPOLICY STATEMENT:\n\nCentral Montessori School (CMS) is committed to providing high quality child care through ongoing professional staff training and development. We believe that the quality of the program depends on staff having knowledge of current theories in brain/child development and practices in the Montessori/Early Childhood Profession. Professional development is a joint responsibility of staff and administration. We also encourage staff to engage in their own professional development outside of work.\n\nDEFINITIONS:\n\nProfessional Development and Training refers to all opportunities for advancement and learning that are planned for both in-house and outside the school. These may include workshops, conferences, webinars, events, observations, reading of articles, books and current studies, or meetings/programs reflecting changes within the Ministry of Education and Childcare Quality Assurance and Licensing, as well as topics relating to brain development, child physical/social/emotional development, cognition and pedagogy.\n\nOrientation refers to job-specific policy review and training of new staff, students and volunteers.\n\nIMPLEMENTATION AND GUIDELINES:\n\nEvery new staff member, student or volunteer working at CMS shall participate in an official Orientation to receive training, information and documents on up-to-date policies and procedures relating to CMS guidelines, Public Health, Fire Safety, and Ministry of Education/Childcare Quality Assurance and Licensing.\n\nIt is the responsibility of the authorized Supervisor or Principal to meet with classroom staff monthly to discuss and suggest areas that need improvement through further development/training of the program or staff members who may benefit from in-school training, self-directed reading, or observations in appropriate settings.\n\nAll CMS staff are eligible for mandatory and optional training and workshops offered by (or through) the school.\n\nTo maintain proper supervision and provide quality care for children, only one staff from each classroom shall participate in development and training at a time during program hours, unless approval has been granted by the Head of School.\n\nAll staff members are required to attend regular staff meetings in which:\n- Resources, skills, ideas, professional experiences and expertise are shared.\n- Current and new policies and procedures of CMS and the Ministry of Education/Childcare Quality Assurance and Licensing are reviewed.\n- Staff decisions are made regarding upcoming school events and occasions.\n\nFIRST AID AND CPR:\n\nAll staff who work at CMS must complete and maintain Standard First Aid with level C CPR (infant, child, and adult).\n\nA mandatory refresher course is provided each school year. CMS will cover half of the cost of this course.",
    "keywords": [
      "training",
      "orientation",
      "professional development",
      "workshops",
      "First Aid",
      "CPR Level C",
      "monthly meetings",
      "policies",
      "staff development"
    ]
  },
  {
  "id": "program_statement",
  "title": "Program Statement Implementation Policy",
  "content": "CMS Program Statement Implementation Policy\n\nOur Program Statement Implementation Policy sets out the expectations for all staff, students and volunteers and guidance on how to implement the approaches specified in our Program Statement. All of our policies and procedures are reviewed by staff, students and volunteers before they begin their employment or placement at CMS, annually thereafter, and at any time a revision occurs.\n\nOur Program Statement describes our aims for children and the approaches that we implement to meet these goals. In this document we will further cover the expectations of staff for each provision in ss.46 (3) (a-k) as set out under the Child Care and Early Years Act and Ontario regulation 137/15.\n\nPromoting the health, safety, nutrition and well-being of children (s.46 (3) (a))\nPROHIBITED PRACTICES\nCMS prohibits all types of physical punishment and other harmful disciplinary actions for the protection of the emotional and physical well-being of children. The prohibited practices are as follows:\n- corporal punishment of the child;\n- physical restraint of the child, such as confining the child to a high chair, car seat, stroller or other device for the purposes of discipline or in lieu of supervision, unless the physical restraint is for the purpose of preventing a child from hurting himself, herself or someone else, and is used only as a last resort and only until the risk of injury is no longer imminent;\n- locking the exits of the child care centre or home child care premises for the purpose of confining the child, or confining the child in an area or room without adult supervision, unless such confinement occurs during an emergency and is required as part of the licensee’s emergency management policies and procedures;\n- use of harsh or degrading measures or threats or use of derogatory language directed at or used in the presence of a child that would humiliate, shame or frighten the child or undermine his or her self-respect, dignity or self-worth;\n- depriving the child of basic needs including food, drink, shelter, sleep, toilet use, clothing or bedding; or\n- inflicting any bodily harm on children including making children eat or drink against their will.\n\nSuggested Procedures for Child Guidance & Preferred Practices\nIf a child is displaying negative or destructive behaviour, he/she shall be guided or redirected in ways that reinforce positive conduct. Staff shall point out acceptable behaviour rather than negative behaviour and allow the child to correct his/her own conduct whenever appropriate.\nContinued disciplinary actions or issues must be reported to the Supervisor/Principal/Head of School. If required, an Individualized Support Plan may be required.\n\nInvolvement of Parents\nParents must be informed of changes in their child’s behaviour that cause concern.\nThe Supervisor/Principal/Head of School must be advised of any child whose actions endanger the safety of the environment, show persistent resistance to authority, or do not respond to guidance.\nActions may include:\n- Hiring extra staff\n- Using the services of a consultant\n- Asking parents to withdraw the child\n\nCONTRAVENTION OF PROGRAM IMPLEMENTATION POLICY\nAll staff, students and volunteers must comply with the CMS Program Statement Implementation Policy and the Child Care and Early Years Act. Any contravention will result in discipline according to Contravention Levels I, II, and III.\n\nDISCIPLINE IN THE CASE OF CONTRAVENTIONS I – REPORTING\n- Each contravention must be reported immediately to the Supervisor/Principal/Head of School.\n- The Supervisor must investigate within one working day.\n- For each confirmed contravention, appropriate action must be taken.\n\nDISCIPLINE IN THE CASE OF CONTRAVENTION II – INVESTIGATION\nThe Supervisor must meet with the staff member within 24 hours to:\n- Identify the difficulty and reason\n- Decide whether an offence occurred and classify it as minor or major\n- Discuss the effect of the action on the child\n- Discuss appropriate behaviour strategies\n- Record the meeting\n\nDISCIPLINE IN THE CASE OF CONTRAVENTIONS III – CONSEQUENCES\nProven Minor Contravention:\n- First offence – verbal warning\n- Second offence – disciplinary letter\n- Third offence – written training program with monthly reviews; dismissal if no improvement\n\nProven Major Contravention:\n(involving prohibited practices)\n- Physical restraint (except last resort safety situations)\n- Confining a child unlawfully\n- Harsh or degrading treatment\n- Depriving basic needs\n\nDisciplinary Action:\n- First offence: disciplinary letter\n- Second offence: suspension or dismissal\n- Third offence: dismissal\n\nSevere Major Contraventions:\n- corporal punishment\n- forcing a child to eat or drink\n\nDisciplinary Action:\n- First offence: immediate suspension without pay or dismissal\n- Second offence: dismissal\n\nExperiencing positive relationships in the early years has a long-term impact on health, mental well-being, and academic success.\n\nSANITARY PRACTICES POLICY\nAll CMS facilities and equipment must be maintained in safe and clean condition. Staff and children must practice proper hygiene.\n\nPersonal Health Practices:\nStaff wash hands:\n- when arriving\n- after using washroom\n- after assisting children in washroom\n- before/after food prep\n\nChildren wash hands:\n- after washroom use\n- before handling food\n- after handling animals\n- after using tissue\n\nFacilities & Equipment:\n- Toys washed weekly\n- Tables wiped before/after meals\n- Floors vacuumed/swept per schedule\n- Carpets vacuumed daily and professionally cleaned seasonally\n- Cubbies cleaned weekly\n- Kitchen appliances kept clean\n- Disposable eating supplies used when required\n- Washrooms cleaned weekly by cleaners; checked daily\n\nNUTRITION & WELL-BEING OF CHILDREN\nCMS provides nutritious meals according to Canada’s Food Guide. Meals are served in a positive atmosphere with staff modelling behaviour and communication. Allergy lists must be displayed. Health concerns must be documented and reported. Illness forms must be completed when a child is picked up sick.\n\nSupporting positive interactions (s.46 (3) (b))\nEncouraging communication and self-regulation (s.46 (3) (c))\nFostering exploration and inquiry (s.46 (3) (d))\nProviding child-initiated and adult-supported experiences (s.46 (3) (e))\n\nCMS classrooms operate on the principle of freedom within limits and Montessori philosophy. Children work at their own pace with chosen materials. Older children mentor younger children, fostering leadership and cooperation.\n\nOur aims include:\n- Happy, secure, stimulating environment\n- Encouraging independence\n- Fostering creativity\n- Supporting language development\n- Enhancing fine and gross motor skills\n- Encouraging exploration and self-expression\n- Providing age-appropriate activities\n- Supporting emotional growth\n- Encouraging peer interactions\n- Maintaining consistent routines\n- Modelling respect and inclusion\n\nPlan for positive learning environments (s.46 (3) (f))\nCMS promotes total development and independence. Classrooms are prepared with accessible, complete, purposeful materials. Staff observe children to introduce new challenges and guide inquiry-based learning.\nFree play fosters creativity and exploration.\n\nIncorporating indoor/outdoor play, active play, rest, and quiet time (s.46 (3) (g))\n- Rest period max 2 hours\n- Children may sleep, rest, or engage in quiet activities\n- Outdoor play min 2 hours daily (weather permitting)\n- Large motor activities included indoors/outdoors\n- Weekly programs: yoga, music, gym, obstacle courses, Rainbow Fun\n\nFostering communication with parents (s.46 (3) (h))\nCMS maintains open communication through policies, calendars, newsletters, weekly updates, reminders, and posted program themes.\n\nInvolving community partners (s.46 (3) (i))\nCMS collaborates with specialists (CCAC, Adventure Place) when extra support is needed. Third-party recommendations may result in program plans. Community helper visits and charity events promote connection and belonging.\n\nSupporting continuous professional learning (s.46 (3) (j))\nCMS supports staff learning through meetings, workshops, Lunch & Learns, annual reviews, observations, and updates from CCEYA.\n\nAs per s.46 (3) (k), strategies in sections (a)–(j) are reviewed through daily observation, reflection, and alignment with “How Does Learning Happen?”. Staff sign off annually and whenever revisions occur. Monitoring procedures ensure compliance.\n\nThis policy will be reviewed by staff, students and volunteers before they begin their employment at CMS, and annually thereafter or at any time a revision occurs. A record of this review will be signed and dated and kept for 3 years.",
  "keywords": [
    "program statement",
    "implementation",
    "prohibited practices",
    "positive guidance",
    "CCEYA",
    "Ontario Regulation 137/15",
    "behaviour guidance",
    "child guidance",
    "discipline",
    "sanitary practices",
    "nutrition",
    "well-being",
    "parent communication",
    "community partners",
    "professional learning",
    "monitoring compliance"
  ]
},{
  "id": "playground_safety",
  "title": "Playground Safety Policy",
  "content": "Playground Safety Policy\nCentral Montessori School (CMS) strives to provide safe outdoor environments that promote creative and constructive play for all children in its care. The purpose of this policy is to ensure that all outdoor play areas are safe and in compliance with the standards set out by the Canadian Standards Association (CSA) standard CAN/SCA-Z614-14, “Children’s play spaces and equipment”.\n\nDAILY VISUAL INSPECTIONS: Designated staff members (weekly rotations) carry out and record daily visual inspections to identify defects, emerging problems and check the entire area for hazardous debris or litter, or damage caused by vandalism or weather, and to ensure no strings or ropes of any kind are present and removed.\n\nMONTHLY DETAILED INSPECTIONS: Monthly inspections are performed and recorded by the Principal/Supervisor/Admin. The inspection includes checking for any damage and wear of equipment, checking for any broken or missing handrails, guardrails, stairs, and damaged fences, gates and retaining walls. Observed defects or emerging issues are documented in the school’s playground repair log and immediately reported to the appropriate persons or companies to organize repairs as soon as possible. Should repairs not be immediate and require time, all reasonable steps shall be taken to block access to the defective area or remove defective equipment until such repairs can be completed.\n\nANNUAL COMPREHENSIVE INSPECTIONS: Annual comprehensive inspections are completed by the Principal/Supervisor/Admin. This inspection involves an analysis of play space maintenance, potential defects and faults, and includes details regarding maintenance and repairs as required. Additionally, a Certified Playground Safety Inspector will conduct an annual inspection. This inspector is a third party and declares non-conflict of interest, including non-affiliation with playground equipment and protective surface manufacturers, suppliers, or contractors involved in upgrades or repairs.\n\nPLAYGROUND SUPERVISION GUIDELINES FOR STAFF:\n- Ratios must be maintained at all times while children are outdoors (Infants 1:3, Toddlers 1:5, Pre-Schoolers 1:8).\n- To facilitate children’s washroom needs, staff will take children inside in small groups, ensuring outdoor ratios remain met.\n- Staff must bring their emergency bags, including first aid boxes, during all outdoor periods. These bags include children’s information, emergency information, allergy lists, epipens/medication (if required), etc.\n- Staff must conduct head counts and roll call procedures at each transition.\n- Staff must check children’s clothing for sources of entanglement (e.g., drawstrings, long scarves).\n- Staff are responsible for continuously enforcing playground safety rules and explaining the reasons behind them.\n- Staff must position themselves throughout the playground to ensure constant and thorough supervision at all times.\n- Conversations between staff must be kept to a minimum to ensure proper supervision.\n- The playground is an ideal space for games, and staff participation can support learning and fun. Staff are responsible for preparing the environment for safety and programming. Activities may vary throughout the year.\n\nOUTDOOR SCHEDULES AND PROGRAM PLANS\nDaily outdoor play times are predetermined for the school year for each classroom and are posted outside every classroom for staff and parents. Outdoor program plans are available to staff and provide games and activities that enhance gross motor play and encourage creative play.\n\nThe policy will be reviewed by the staff, students and volunteers before they begin their employment at CMS, and annually thereafter or at any time a revision occurs. A record of this review will be signed and dated by the person who participated and conducted the review. This record will be maintained for a minimum of 3 years.",
  "keywords": [
    "playground",
    "outdoor play",
    "CSA standards",
    "CAN CSA Z614",
    "visual inspection",
    "daily inspection",
    "monthly inspection",
    "annual inspection",
    "supervision ratios",
    "infant ratio",
    "toddler ratio",
    "preschool ratio",
    "hazard",
    "vandalism",
    "equipment damage",
    "emergency bag",
    "headcount",
    "roll call",
    "entanglement",
    "drawstrings",
    "scarf",
    "safety rules",
    "gross motor play",
    "outdoor schedule"
  ]
},
{
  "id": "parent_issues_concerns",
  "title": "Parent Issues and Concerns Policy and Procedures",
  "content": "Parent Issues and Concerns Policy and Procedures\n\nPurpose\nThe purpose of this policy is to provide a transparent process for parents/guardians, Central Montessori School and staff to use when parents/guardians bring forward issues or concerns.\n\nPOLICY\nGeneral\nParents/guardians are encouraged to take an active role in our school and regularly discuss what their child(ren) are experiencing with our program. As supported by our program statement, we support positive and responsive interactions among children, parents/guardians, child care providers and staff, and foster ongoing communication about the program and their children. Staff are available to engage with parents/guardians and support a positive experience at every interaction.\n\nAll issues and concerns raised by parents/guardians are taken seriously by CMS staff and will be addressed. Every effort will be made to resolve issues and concerns to the satisfaction of all parties as quickly as possible.\n\nIssues or concerns may be brought forward verbally or in writing. Responses and outcomes will be provided verbally or in writing upon request. The level of detail shared will respect confidentiality.\n\nAn initial response will be provided to parents/guardians within 1 to 2 business days. The individual raising the concern will be kept informed throughout the process.\n\nInvestigations will be fair, impartial, and respectful to all parties.\n\nConfidentiality\nAll issues and concerns will be treated confidentially. Information will only be disclosed when required for legal reasons (e.g., Ministry of Education, CECE, law enforcement, CAS).\n\nConduct\nCMS maintains high standards for communication, professionalism and role modeling. Harassment or discrimination will not be tolerated.\n\nIf at any point a parent/guardian, provider, or staff feels uncomfortable, threatened, abused, or belittled, they may immediately end the conversation and report the situation to the supervisor or licensee.\n\nConcerns About Suspected Abuse or Neglect\nEveryone, including the public and professionals, must by law report suspected child abuse or neglect.\nIf a parent/guardian expresses concerns about possible abuse or neglect, they will be advised to contact the local Children’s Aid Society (CAS) directly.\nAnyone aware of such concerns must also report to CAS as part of the “Duty to Report.”\nFor more information visit: http://www.children.gov.on.ca/htdocs/English/childrensaid/reportingabuse/index.aspx\n\nPROCEDURES:\n\nNature of Issue or Concern / Steps for Parent / Steps for Staff\n\nProgram Room-Related (e.g., schedule, sleep arrangements, toilet training, indoor/outdoor program, feeding arrangements)\nParents/guardians should:\n- Raise the issue to classroom staff directly or the supervisor/licensee.\n\nStaff must:\n- Address the concern immediately or arrange a meeting within 1–2 business days.\n- Document the concern including:\n  • date/time received\n  • name of person who received it\n  • name of person reporting\n  • details of the concern\n  • all steps taken and information provided\n- Provide contact information for the correct person if needed.\n- Begin investigation within 1–2 business days and document any delays.\n- Provide a resolution or outcome to the parent/guardian.\n\nGeneral, Centre- or Operations-Related (e.g., fees, hours, staffing, waiting lists, menus)\nParents/guardians should raise concerns to the supervisor or licensee.\n\nStaff-, Supervisor-, or Licensee-Related\nParents/guardians should raise concerns directly with the individual or with the supervisor/licensee.\nAny conduct that puts a child’s health or safety at risk must be reported immediately to the supervisor.\n\nStudent- / Volunteer-Related\nParents/guardians should raise concerns with the supervising staff or the supervisor/licensee.\nConcerns involving health or safety risk must be reported immediately.\n\nEscalation of Issues or Concerns\nIf parents/guardians are not satisfied with the response or outcome, they may escalate verbally or in writing.\n\nIssues relating to compliance with the Child Care and Early Years Act, 2014 or Ontario Regulation 137/15 should be reported to the Ministry of Education’s Child Care Quality Assurance and Licensing Branch.\n\nIssues may also be reported to:\n- Public Health\n- Police\n- Ministry of Environment\n- Ministry of Labour\n- Fire Department\n- College of Early Childhood Educators\n- Ontario College of Teachers\n- College of Social Workers\n\nContacts:\nSupervisor: Ms. Xxxxxx, xxx@cmschool.net, Tel: (xxx) xxx-xxxx\nAdministrator: Ms. Xxxxx, xxx@cmschool.net, Tel: (xxx) xxx-xxxx\nHead of School: Mrs. Minoo Mohajer, mmohajer@cmschool.net\nMinistry of Education Licensed Child Care Help Desk: 1-877-510-5333 or childcare_ontario@ontario.ca\n\nDate Policy and Procedures Established:\nDate Policy and Procedures Updated: March 19, 2019",
  "keywords": [
    "parent issues",
    "parent concerns",
    "complaints",
    "resolution process",
    "confidentiality",
    "duty to report",
    "abuse",
    "neglect",
    "CAS",
    "investigation",
    "program room issues",
    "operations issues",
    "staff conduct",
    "student volunteer conduct",
    "escalation"
  ]
},
{
  "id": "behaviour_management_monitoring",
  "title": "Behaviour Management Monitoring Policy",
  "content": "As part of the interview process for staff, students and volunteers, a comprehensive discussion of the centre’s behaviour management policy is carried out to ensure compatibility with the centre’s philosophy and legislative requirements.\n\nStaff, students and volunteers are required to review the prohibited and permitted practices prior to having contact with the children. All staff will have knowledge of the consequences of violating the policy.\n\nThe policy will be signed, witnessed and dated at the time of orientation and annually thereafter; a record will be retained for at least two years.\n\nStaff performance appraisals will include a specific section related to behaviour management/child guidance practices to ensure that staff have a full understanding of practices appropriate for certain age groups.\n\nStaff, students and volunteers are obligated to report any incident to the supervisor; this will be discussed, documented and kept on file.\n\nIn the event the supervisor is implicated, the employee, student or volunteer observing the inappropriate behaviour will report it directly to the operator/board.\n\nIf unusual disciplinary problems arise, these will be discussed at a full staff meeting to ensure everyone has knowledge of the behaviour management plan for that child.\n\nThe supervisor will carry out both daily and scheduled observations to monitor behaviour management practices of staff, students and volunteers who provide care and guidance to the children. Monitoring behaviour management will be done once per school year.\n\nThe operator/board is responsible for monitoring the supervisor.\n\nThe operator/board will ensure that regular monitoring is carried out and that a tracking process is in place. A record will be kept for at least two years.\n\n\nOBSERVATIONAL RECORD OF BEHAVIOUR MANAGEMENT PRACTICES\n\nBEHAVIOUR OBSERVED\n\n\n\nIMMEDIATE ACTION TAKEN\n\n\n\nPLAN FOR IMPROVEMENT\n\n\n\nDATE OF REVIEW          SUPERVISOR’S SIGNATURE          STAFF SIGNATURE\n\n\n\nSUPERVISION OF CHILDREN AND BEHAVIOUR MANAGEMENT MONITOR\n\nDate:_________________        Period to be covered:__________________\n\nBehaviour Management Practices to be Viewed\nSatisfactory/Comments\nNeed to Improve/Comments\n- Provides constant supervision of all children, never leaving them unattended\n- Establishes and defines expectations for groups and individuals\n- Uses appropriate language and voice level\n- Provides positive reinforcement\n- Guides behaviour in a positive manner\n- Is firm and consistent when guiding behaviour\n- Models attitudes and behaviour patterns expected of children\n- Establishes and maintains room control\n- Encourages problem solving and decision making\n- Shows respect for children by acknowledging their feelings and responding appropriately\n- Body language is positive and reflects spoken words\n- Respects individual differences and needs; avoids comparison or degrading comments\n- Avoids power struggles with children\n- Emphasizes strengths, not weaknesses\n\nIs staff member in compliance at this time: Yes____ No___\n\nStaff confirms that they have or have not observed compliance: Yes____ No___",
  "keywords": [
    "behaviour management",
    "monitoring",
    "staff guidance",
    "discipline policy",
    "prohibited practices",
    "permitted practices",
    "orientation",
    "annual review",
    "performance appraisal",
    "supervisor observations",
    "reporting misconduct",
    "behaviour plan",
    "child guidance"
  ]
},
{
  "id": "medication_administration",
  "title": "Medication Administration Policy and Procedures",
  "content": "POLICY:\n\nCentral Montessori Schools will only administer prescribed drugs or over-the-counter medication accompanied by a doctor's note. Medications will be administered as per legislation and in accordance with Health Department standards.\n\nPROCEDURE:\n\nWhen a parent initially brings in a drug or medication, a Medication Dispensing Form is completed and signed by the parent and the staff in charge. The Medication Dispensing Form is then placed on the class notice board and recorded in the class logbook for all staff.\n\nThe staff who receives the medication and the Medication Dispensing Form must check that the medication:\n- Is in the original container with the pharmacy label attached\n- Has the child’s name on it\n- Has the name of the drug on it\n- Lists the dosage to be given\n- Lists the date of purchase\n- Includes instructions for storage\n- Includes instructions for administration (time/frequency)\n- Has the physician’s name and phone number\n\nStaff will review the Medication Dispensing Form and compare it with the medication label. Any discrepancies will be discussed with the parent.\n\nThe Medication Dispensing Form is reviewed daily during administration of the drug.\n\nParents must initial the form if any changes are made to the plan.\n\nEach room has two medication bags for refrigerated and non-refrigerated medications. Staff lock the medication in the appropriate bag and store it accordingly. Keys are hung on the classroom information board.\n\nOnly RECEs, qualified staff, or designated staff in charge may administer medications.\n\nIf possible, staff should take the child to a quiet/private area to administer the medication using the measuring tool provided. After administration, staff must sign and record the dosage and date on the Medication Dispensing Form.\n\nIf the medication is not administered on time, the actual time administered must be documented and the parent notified.\n\nUpon completion of the medication’s specified duration, any medication left over will be returned to the parent.\n\nIf parents request that the medication be discontinued, staff must document the request and date and return the medication to the parent.\n\nAfter completion and sign-off, the Medication Dispensing Form is placed in the child’s file in the main office.\n\nThis policy will be reviewed by staff, students and volunteers before they begin their employment at CMS, and annually thereafter, or at any time a revision occurs. A record of this review will be signed and dated by the person who participated and conducted the review and will be kept for a minimum of 3 years.",
  "keywords": [
    "medication",
    "administration",
    "prescription drugs",
    "over the counter medication",
    "doctor's note",
    "Medication Dispensing Form",
    "pharmacy label",
    "dosage",
    "storage instructions",
    "administration instructions",
    "refrigerated medication",
    "non-refrigerated medication",
    "RECE",
    "designated staff",
    "medication bags",
    "medication logbook",
    "parent initials",
    "documentation",
    "child's file"
  ]
},
{
  "id": "fire_safety",
  "title": "Fire Safety Evacuation Procedures",
  "content": "Fire Safety Evacuation Procedures\n\nLIST OF EMERGENCY PHONE NUMBERS\n\nFIRE – AMBULANCE – POLICE: 911\nTORONTO POLICE – NON-EMERGENCY: (416) 808-2222\nLOCAL AMBULANCE / PARAMEDIC SERVICES: (416) 392-2000\nPOISON CONTROL CENTRE: (416) 813-5900\nNORTH YORK GENERAL HOSPITAL: (416) 756-6000\nEMERGENCY AMBULANCE / PARAMEDICS: (416) 489-2111\n\nPROGRAM ADVISER:\nCrystal Sotelo – (416) 931-6117\n\nSCHOOL NUMBERS:\nMaplehurst: (416) 222-9207\nEarly Years Maplehurst: (416) 221-3289\nWillowdale: (416) 250-1022\nThornhill: (905) 889-0012\nYork Mills: (416) 510-1200\n\nMrs. Mohajer (cell): (416) 822-3427\nMs. Neda Mohajer (cell): (647) 830-3826\n\nEMERGENCY SHELTER\nMaplehurst Early Years School\n180 Sheppard Ave. East\nToronto, ON M2N 3A4\n\nWillowdale Campus\n157 Willowdale Ave.\nToronto, ON M2N 4Y7\n\nFIRE SAFETY PROCEDURES\n\nSTAFF RESPONSIBILITIES\n\n1st TEACHER:\nImmediately gather all children, proceed to the nearest exit and take a quick headcount.\n\n2nd TEACHER:\nBring the daily attendance sheet and emergency box.\n\nASSISTANT TEACHER:\nCheck all windows and doors are closed, lights are off, and no one is left behind.\n\nOnce outside, take attendance and keep children at a safe distance. Teachers must wait for instructions on whether to return or proceed to the Emergency Shelter.\n\nEMERGENCY SHELTER\nMaplehurst Early Years School\n180 Sheppard Ave. East\nToronto, ON M2N 3A4\n\nWillowdale Campus\n157 Willowdale Ave.\nToronto, ON M2N 4Y7\n\nFIRE SAFETY PROCEDURES\n\nSTAFF RESPONSIBILITIES\nEach staff member is responsible for the group of children they are supervising.\nImmediately gather all children, bring the attendance sheet, proceed to the nearest exit, and evacuate quickly.\nGo to the Emergency Shelter at Central Montessori School, Maplehurst Early Years – 180 Sheppard Avenue East, Toronto, ON M2N 3A4.\nThe staff person in charge will close all doors and windows and call 911.\nThe staff person in charge will bring the attendance sheet and emergency binder.\nWait at the shelter for further instructions.\nIf Minoo Mohajer is not present, contact her at 416-822-3427.\n\nSUPERVISOR/OWNER RESPONSIBILITIES\n1) Ensure all children and staff know the proper exits.\nInstruct children on proper evacuation procedures and ensure procedures are posted for temporary staff.\nEnsure all staff are trained in the use of fire protection equipment and understand their responsibilities.\nThe supervisor or person in charge will contact parents to notify them and provide information.\nContact the Ministry of Community & Social Services, Child Care Services (416) 325-0677 within 24 hours.\nRecord and keep all information on file.\n\nFIRE SAFETY MAINTENANCE DUTIES\n\nDAILY\n- Check all exit doors are unlocked and unobstructed (2.7.1.7.(1)).\n- Check exit and corridor lighting to ensure they are illuminated (2.7.1.7.(2)).\n\nWEEKLY\n- Ensure combustible artwork and teaching materials on walls do not exceed 20% of wall area (2.10.11).\n- Check all flammable and combustible liquids are stored appropriately and inaccessible to children (2.10.1.3).\n\nMONTHLY\n- Conduct fire drills (2.8.3.2.(1)(A)).\n- Inspect portable fire extinguishers (6.2.7.2).\n- Test fire alarm system (6.3.2.1).\n- Test smoke alarms (9.3.4.1).\n\nSIX MONTHS\n- Change batteries in smoke alarms.\n\nThis log book complies with Ontario Fire Code regulation 730-81 and Day Nurseries Act (Chapter D.2 – RSO 1990).\n\n“A written record is kept of all fire drills, all tests of the fire alarm system and all tests of the fire protection equipment and that each record is retained for at least two years from the date of the drill and test.” Reg. 262.",
  "keywords": [
    "fire safety",
    "evacuation",
    "emergency",
    "fire drill",
    "staff responsibilities",
    "emergency shelter",
    "attendance sheet",
    "emergency box",
    "supervisor responsibilities",
    "fire alarm",
    "smoke alarm",
    "extinguishers",
    "daily checks",
    "monthly checks",
    "six month checks"
  ]
},
{
  "policy_id": "emergency_management",
  "title": "Emergency Management Policy and Procedures",
  "category": "Health & Safety",
  "keywords": [
    "emergency",
    "evacuation",
    "lockdown",
    "hold and secure",
    "bomb threat",
    "natural disaster",
    "earthquake",
    "tornado",
    "environmental threat",
    "meeting place",
    "evacuation site",
    "emergency response",
    "all-clear",
    "unsafe to return",
    "staff roles",
    "children safety",
    "supervision",
    "emergency contacts",
    "recovery procedures",
    "communication with parents",
    "debriefing",
    "first aid",
    "emergency bag",
    "regulation 137/15"
  ],
  "content": "Purpose:\nThe purpose of this policy is to provide clear direction for all CMS staff to follow in emergency situations. These procedures outline steps staff must follow to ensure the safety and well-being of everyone involved.\n\nDefinitions:\nAll-Clear: Notification that a threat or disaster no longer poses danger.\nEmergency: An urgent situation requiring immediate action to ensure safety.\nAuthority: Person or entity providing direction during an emergency.\nEmergency Services Personnel: Police, fire, EMS, rescue services.\nEvacuation Site: Designated off-site location for shelter.\nMeeting Place: Safe place near the school where individuals gather.\nUnsafe to Return: Notification that the centre remains unsafe.\n\nPolicy:\nStaff must follow procedures during Immediate Response, Next Steps, and Recovery.\nChildren must be supervised and accounted for at all times.\n\nMeeting Place: Front of the school building.\nEvacuation Site: CMS – 157 Willowdale Avenue.\n\nEmergency services instructions override all procedures.\n\nProcedures for children with individualized plans must be followed.\nAll emergencies must be documented in detail.\nRegular fire and lockdown drills will be conducted.\nEach classroom must have an emergency bag with contact lists, allergy lists, medication and first aid.\n\nProcedures:\n\nPhase 1: Immediate Emergency Response\n\nLockdown:\n- Staff notify office and all staff immediately.\n- Move children away from doors/windows.\n- Take attendance.\n- Shelter in closets or under furniture.\n- Keep children calm.\n- Turn off/mute phones.\n- Office locks all exterior doors.\n\nHold & Secure:\n- Threat near but not inside the school.\n- Outdoor staff return children inside.\n- Take attendance.\n- Close blinds and windows.\n- Continue normal programming.\n- Office locks all exterior doors.\n\nBomb Threat:\n- Remain calm.\n- Call 911.\n- Follow instructions from emergency personnel.\n- Take attendance.\n- Do not touch suspicious packages.\n\nDisaster Requiring Evacuation:\n- Notify all staff.\n- Remain calm.\n- Gather children, attendance, emergency contacts and medication.\n- Exit through nearest safe exit.\n- Go to meeting place.\n- Take attendance.\n- Keep children calm.\n\nExternal Environmental Threat:\n- Examples: gas leak, chemical spill, smoke, nuclear event.\n- Close all windows and seal external air entryways.\n- Turn off HVAC.\n- Follow emergency personnel instructions.\n\nTornado:\n- Move children to basement or interior rooms.\n- Keep away from windows.\n- Take attendance.\n- Keep children calm.\n\nEarthquake:\n- Instruct children to get under sturdy furniture.\n- Keep away from windows.\n- After shaking stops, gather children and evacuate.\n- Meet at designated meeting place.\n\nPhase 2: Next Steps During Emergency\n\n- Notify emergency services if not already aware.\n- Notify Head of School, Principal or Supervisor.\n- Notify off-site staff and volunteers.\n- Keep children calm and supervised.\n- Administer first aid if required.\n\nAll-Clear Procedures:\n- Notify all staff.\n- Assist individuals with medical needs.\n- Take attendance.\n- Return children to program rooms.\n- Reopen blinds, windows, and doors.\n- Notify parents.\n\nUnsafe to Return Procedures:\n- Move from meeting place to evacuation site.\n- Take attendance.\n- Assist individuals with special needs.\n- Notify parents.\n- Remain until all children are picked up.\n\nPhase 3: Recovery\n\n- Inspect centre before returning children.\n- Report Serious Occurrence to CCLS.\n- Direct media inquiries to administration.\n- Communicate updates to parents.\n- Provide emotional support if needed (psychologist, grief counsellor).\n- Debrief staff, children and parents.\n\nRegulatory Requirements:\nOntario Regulation 137/15 requires emergency management policies outlining roles/responsibilities, support for special needs, evacuation plans, supervision, communication, emergency contacts, and recovery procedures."
}


]