
[
  {
  "id": "sleep_toddlers",
  "title": "Sleep Supervision Policy and Procedures (Toddler & Preschool)",
  "content": "The Sleep Supervision Policy and Procedures (Toddler & Preschool)\nThe CMS Sleep Supervision Policy’s intent is to reduce the risk of harm or injury when children are sleeping. Parents/Guardians of children who regularly sleep at the center will be initially consulted with respect to their child’s sleeping arrangements, sleeping preferences, precautions and required accommodations at the time of enrollment and at any time changes might be required, such as during transitions between programs/room, or when changes are requested by parents. Special sleeping instruction will be recorded on a child’s application annually or as changes are required thereafter. Staff will be informed of a child’s sleeping arrangements by the office upon initial registration, annually thereafter, or when changes are requested or made. Significant changes in a child’s sleeping patterns or behaviours will be immediately communicated with parents as they arise verbally or through the daily communicable book.\n\nGeneral Procedures:\nChildren are assigned to individual cots labelled with the child’s name and class number/name to identify which children are present in the area or room.\n\nCots comply with the standards in the regulations made under the Canada Consumer Product Safety Act.\n\nParents will be consulted at the time of enrollment with respect to a child’s sleeping arrangements.\n\nThere must be sufficient light in the sleeping area or room to conduct direct visual checks of children through the use of lamps or leaving blinds open (as required).\n\nStaff must perform a direct visual check of all sleeping children every 30 minutes by being physically present beside the child while the child is sleeping and looking for indicators of distress or unusual behaviours such as: changes in the colour of the skin, breathing patterns, signs of overheating, etc. Staff will document the direct visual checks being conducted on every child’s sleep tracking sheet.\n\nThe observance of any significant changes in a child’s sleeping patterns or behaviours during sleep will be tracked and communicated to parents verbally. This might result in adjustments to the manner in which the child is supervised during sleep and details regarding the performance of direct visual checks and how frequently direct visual checks will be performed.\n\nSystem to identify the use of Sleep Room:\n\nStaff are required to record sleeping children’s name in their daily log book and ensure that the time of their return to the classroom is logged to ensure children are accounted for at all times, whether in the sleep room or in the classroom.\n\nThis policy will be reviewed by staff, students and volunteers before they begin their employment at CMS, and annually thereafter, or at any time a revision occurs. A record of this review will be signed and dated by the person who participated and conducted the review and will be kept for a minimum of 3 years.",
  "keywords": [
    "toddler sleep",
    "preschool sleep",
    "cot",
    "sleep supervision",
    "30 minute checks",
    "sleep tracking sheet",
    "sleep room",
    "visual checks",
    "sleep arrangements",
    "parent consultation",
    "daily log"
  ]
},
  {
  "id": "serious_occurrence",
  "title": "Serious Occurrence Policy",
  "content": "Serious occurrences must be reported to the Ministry as defined under the Child Care and Early Years Act. These include: the death of a child, abuse or alleged abuse, life-threatening injury or illness, a missing or temporarily unsupervised child, and any unplanned disruption to operations that creates a risk to health or safety. Staff must respond immediately depending on the situation: call 911 for death, life-threatening injury, illness, fire, gas leak, carbon monoxide, or lockdown; call CAS for allegations of abuse or neglect; contact Toronto Public Health during outbreaks; contact City services for flood (311). Serious Occurrences must be reported through CCLS within 24 hours, and the Program Advisor must also be notified within 24 hours. A Serious Occurrence Notification Form must be posted for a minimum of 10 business days, protecting all personal information (no names, initials, ages, or room identifiers). An internal inquiry must begin immediately, collecting details including description, allegation, date/time, reason, people involved, actions taken, and current status. If abuse is suspected, CAS must be contacted by the person with reasonable grounds. Supervisors conduct an annual analysis of all serious occurrences and maintain records for 3 years. Employers must report RECE incidents involving misconduct, suspension, termination, or resignation under investigation to the College of ECE within 30 days.\n\nDEFINITION: Serious occurrences to be reported by CMS to the ministry are defined as follows in the Child Care and Early Years Act: The death of a child who received child care at the child care centre, whether it occurs on or off premises; Abuse, neglect or an allegation of abuse or neglect of a child while receiving child care at the centre; A life-threatening injury to or a life-threatening illness of a child who receives child care at the centre; An incident where a child who is receiving child care at the centre goes missing or is temporarily unsupervised; or An unplanned disruption of the normal operations of a child care centre that poses a risk to the health, safety or well-being or children receiving child care at the centre. Note: Within the parameters of the preceding definitions, Central Montessori School is responsible for determining whether an incident is deemed to be a serious occurrence as defined by these procedures, and whether it should be reported to the ministry.\n\nRESPONDING TO A SERIOUS OCCURRENCE: Death of a child: 911. Allegation of Abuse and/or Neglect: Children's Aid Society (CAS) 416-924-4646. Ministry Program Advisor. Life-threatening Injury or Illness: Injury: 911. Illness: 911 & Toronto Public Health. Missing or Unsupervised Child: 911 Police Department - CAS - Ministry Program Advisor. Unplanned Disruption of Normal Operations: Fire – 911 Fire Department. Flood – 311 City of Toronto. Gas Leak – 911 Direct Energy 1-866-763-5427. Detection of Carbon Monoxide – 911 City of Toronto 311. Outbreak – Toronto Public Health 416-338-7600. Lockdown – 911. Other Emergency Relocation or Temporary Closure – 911 Ministry Program Advisor (through CCLS) Toronto Public Health 416-338-7600.\n\nREPORTING PROCEDURES: A Serious Occurrence must be reported online using the Child Care Licensing Information System (CCLS) within 24 hours. Any other occurrence to be deemed serious must be reported within 24 hours. As of Oct. 1st, 2016, it is no longer required to report serious occurrences to the City of Toronto. Reports will automatically be forwarded to Children Services. The report must be provided to the program advisor within 24 hours via telephone or email.\n\nSERIOUS OCCURRENCE NOTIFICATION FORM: Following submission of the Serious Occurrences on CCLS, the operator will print out a Serious Occurrence Notification Form to communicate information to parents. The form will be posted near the Child Care Licence and Licensing Summary Chart for a minimum of 10 business days. Updates restart the 10-day period. Personal information must not be included (names, initials, ages, birth dates, room identifiers).\n\nACTIONS TO BE TAKEN: The child shall receive immediate medical attention if needed. Address any continuing risks. Notify the coroner immediately in all cases involving death. Witnesses must report information to the designated person. The supervisor must begin an inquiry immediately. All persons with knowledge of the occurrence must remain available until interviewed. Inquiry details should include: description, allegations, date/time, reason, people involved, actions taken, status, coroner info, further recommendations (police, CAS, parents, others). If there is reasonable suspicion of abuse, CAS must be contacted by the person who suspects it. If alleged abuse occurred at CMS, CAS and the Program Advisor must be notified. If the supervisor is absent, the administrator reports; if both are absent, the Head of School reports.\n\nANNUAL ANALYSIS: Completed by Supervisor. Used to identify issues, trends, and actions. Records kept for 3 years. Policy reviewed annually and stored securely for 3 years.\n\nEMPLOYER’S MANDATORY REPORTING: Employers must report to the College of Early Childhood Educators if an RECE is terminated, suspended, restricted, or resigns under investigation. Reports of misconduct must be submitted within 30 days, including the Serious Occurrence report.",
  "keywords": [
    "serious occurrence",
    "CCLS",
    "reporting",
    "24 hours",
    "Program Advisor",
    "notification form",
    "CAS",
    "police",
    "Toronto Public Health",
    "life-threatening injury",
    "missing child",
    "abuse or neglect",
    "inquiry",
    "annual analysis",
    "privacy requirements",
    "RECE mandatory report"
  ]
},
  {
  "id": "sleep_infants",
  "title": "Sleep Supervision Policy and Procedures (Infants)",
  "content": "The purpose of this policy is to reduce risk of harm or injury, including death, when infants are sleeping. CMS ensures that children younger than 12 months are placed for sleep according to the Public Health “Joint Statement on Safe Sleep: Preventing Sudden Infant Deaths in Canada.” Infants up to their first birthday must be placed on their backs unless a medical doctor provides written instructions otherwise. Once infants can roll independently, they do not need repositioning. Children are assigned individual cribs labelled with their name and a picture card. Cribs must comply with Canada Consumer Product Safety Act; each crib has a documented record of make, model, and year produced. Annual crib checks must be documented and kept for three years. Parents are verbally consulted on sleep arrangements at enrolment and during transitions; staff follow Health Canada’s back-to-sleep recommendations unless a physician provides alternate written instructions. Transition to toddler room requires a signed consent letter confirming cot use. Infants must wear fitted, breathable sleepwear appropriate to room temperature; no pillows, duvets, bumper pads or extra items allowed. Adequate lighting is required to perform direct visual checks. Staff must conduct visual checks every 15 minutes while physically beside the child, monitoring skin colour, breathing, overheating, and document each check on the sleep tracking sheet. Significant sleep pattern changes must be communicated to parents verbally or through daily reports. Strollers, swings, bouncers and car seats are not intended for sleep; if an infant falls asleep in one, they must be moved to their crib as soon as possible. Staff must place name tags of sleeping children at the sleep room door. If more than three infants are in the sleep room, one staff must be physically present inside. Electronic sleep monitors cannot replace visual checks; devices are checked daily and documented. Non-functioning devices must be reported for repair or removal. Policy must be reviewed by staff, students and volunteers before employment and annually thereafter; review records must be kept for three years. The Sleep Supervision Policy and Procedures (Infants) The purpose of this policy and procedures is to reduce the risk of harm and injury, including death, when infants are sleeping.  CMS will ensure that children younger than 12 months of age are placed for sleep in a manner consistent with the recommendation as set out in the Public Health’s  “Joint Statement on Safe Sleep: Preventing Sudden Infant Deaths in Canada.” Note:    The current recommendation set out in the most current version of the Joint Statement on Safe Sleep:  Preventing Sudden Infant Deaths in Canada is that children up to their first birthday be placed on their backs for sleep.  This requirement can only be waived if a medical doctor/ physician recommends otherwise in writing. Once infants are able to roll from their backs to their stomachs or sides, it is not necessary to reposition them onto their backs. Procedure: Children are assigned to individual cribs labelled with their name and a picture card placed above their crib to immediately identify which children are present in the area or room. Cribs comply with the standards in the regulations made under the Canada Consumer Product Safety Act. A document will be completed for each crib in the infant room and filed in a secure location with the make, model number and the year it was produced. Annual checks will be conducted and documented to confirm that the cribs meet the standards as set out in the Public Health Agency of Canada’s Joint Statement on Safe Sleep. See attached document. This document will be filed and maintained at CMS for three years. Parents are consulted with respect of a child’s sleeping arrangement verbally at the time of enrollment, and at any time changes might be required, such as during transitions between programs/room, or when changes are requested by parents.  Parents will also be advised that children 12 months and younger will be placed on their backs for sleep in accordance with the Joint Statement on Safe Sleep. This has been Health Canada’s recommendation since 1993 to reduce the risk of Sudden Infant Death Syndrome (SIDS). CMS shall adhere to these recommendations unless a child’s physician recommends otherwise in writing regarding an alternate sleep positions. This information is transferred to the “sleep card” which is placed over the child’s crib and reviewed by staff in the infant room. Parents will be consulted before an infant is transitions to the toddler room and will receive a consent letter to approve the transition of their child from an infant crib to a cot for nap time. This letter will be signed and dated by the parents and the staff and will be placed in the child’s file. Infants are safest when placed to sleep in a fitted one-piece sleepwear that is comfortable at room temperature to reduce the risk of overheating and minimize the use of blankets. If a blanket is used, it must be of breathable fabric. There should not be any extra items in the crib such as a pillow, duvet, bumper pads, etc. There must be sufficient light in the sleeping area or room to conduct direct visual checks of children through the use of lamps or leaving blinds open (as required). Staff must perform a direct visual check of all sleeping children every 15 minutes by being physically present beside the child while the child is sleeping and looking for indicators of distress or unusual behaviours such as: changes in the colour of the skin, breathing patterns, signs of overheating, etc. Staff will document the direct visual checks being conducted on every child’s the sleep tracking sheet. The observance of any significant changes in a child`s sleeping patterns or behaviours during sleep will be tracked and communicated to parents either verbally or through daily reports. This might result in adjustments to the manner in which the child is supervised during sleep and details regarding the performance of direct visual checks and how frequently direct visual checks will be performed. Strollers, swings, bouncers and car seats are not intended for infant sleep. An Infant’s head when sleeping in a seated position can fall forward and cause their airway to become constricted. Once an infant falls asleep, the child should be moved as soon as possible or as soon as the destination is reached to sleep in the crib. System to identify the use of Sleep Room: Staff are required to place the name tag of the children sleeping in the sleep room on the door/wall outside the room to identify the children sleeping. When there are more than 3 infants in the sleep room, one staff member must be physically present in the sleep room. Electronic Monitoring Devices: Electronic sleep monitoring devices are not used as a replacement for the direct visual checks as required under the Joint Statement on Safe Sleep. Staff will still conduct direct visual checks of sleeping children in accordance to the regulation in addition to using monitoring devices. The staff will check the device daily to ensure it is functioning properly. The time, date and condition of the device will be documented on the device tracking sheet daily. If the device is not working, the staff will inform the supervisor to get it fixed or to be removed from the room This policy will be reviewed by staff, students and volunteers before they begin their employment at CMS, and annually thereafter, or at any time a revision occurs.  A record of this review will be signed and dated by the person who participated and conducted the review. This record will be maintained for a minimum of 3 years in a secure location at CMS. RE: INFANT-TODDLER SLEEP TRANSITION  CHILD’S NAME: D.O.B.I, understand that my child is transitioning to the Toddler room and is using a toddler cot during nap time. I understand that while my child is using the cot, the teachers will continue to monitor his/her sleep as set out in the CMS Sleep Supervision Policy for Infants. Parent/Guardian SignatureDate RE: INFANT-TODDLER SLEEP TRANSITION CHILD’S NAME:D.O.B.I,, understand that my child is transitioning to the Toddler room and is using a toddler cot during nap time. I understand that while my child is using the cot, the teachers will continue to monitor his/her sleep as set out in the CMS Sleep Supervision Policy for Infants.Parent/Guardian Signature Date",
  "keywords": [
    "infant sleep",
    "sleep supervision",
    "back to sleep",
    "Joint Statement on Safe Sleep",
    "crib safety",
    "Canada Consumer Product Safety Act",
    "15 minute checks",
    "sleep tracking sheet",
    "SIDS",
    "sleep room",
    "monitoring devices",
    "infant transitions",
    "cot transition",
    "safe sleep environment",
    "overheating",
    "visual check",
    "infants under 12 months"
  ],
  "link": "https://docs.google.com/document/d/1HoWGu9GNCalQ4QzIVwtIopinMJC79lNX"
},
  {
    "id": "students_volunteers",
    "title": "Supervision of Students & Volunteers Policy",
    "content": "supervision of students & volunteers policy Central Montessori School supports the education of future professionals through field placements, and volunteers as an additional support and value to our programs.Students and volunteers are supervised and function under the direction of qualified CMS staff, and must never be left alone with children or replace a staff member.Expectations of Students and Volunteers Student and Volunteers: must be 18 years or older are never left alone with the children, are not included in staffing ratios, and will be supervised and  mentored by a qualified CMS teaching staff member at all times are required to wear identification badges or tags are required to obtain a Vulnerable Sector Check must review and sign the Prohibited Practices Policy, as well as receive all CMS policies & procedures and existing Individual Support Plans before commencing placement must review and sign the Anaphylaxis Policy and emergency procedures with a CMS supervisor/ principal, or a mentoring staff before the commencement placement must notify their Supervisor/ Principal as soon as possible if they are to be absent. For everyone’s benefit sick staff should not be at school.  If showing any signs of fever, vomiting, diarrhea or communicable diseases (pink eye, chicken pox) etc.it is requested that they stay home until no longer ill, OR when necessary, a doctor clears them to come back to work. are urged to use tact, diplomacy and politeness when dealing management, parents and teachers.  They must use “Mr.” “Mrs.” “Miss” when speaking with the Supervisor/Principal, other staff and with parents.  If students/volunteers encounter any difficulties, they should contact the Supervisor/Principal as soon as possible. must never address parents on a first name basis - unless specifically requested by the parent. must refer parents to the classroom teacher if they are asked questions about the child, program, etc. shall not have lunch or make any private arrangements with parents and or children outside of the school or during school hours unless approved by the Principal/Head of School. shall not use confidential information, photograph or video tape any child or employee at the school for any purpose, unless written consent is received by the Head of School/Principal/Supervisor. must never give the phone number, address or any other personal information regarding any of the parents, teachers, Supervisors, Principal, Head of the School or any other employee of CMS to anyone. must not speak to other employees in a foreign language in front of the children.  Only English may be spoken, unless French, Spanish etc. lessons are in progress.  All children must be spoken to in English at ALL TIMES, unless otherwise requested by his/her parents or the school. must adhere to the appropriate dress code policy Roles and Responsibiltites of Students and Volunteers General supervised participation and engagement with students during daily activities and planned program Assisting classroom teachers and engaging with students during activities such as arts & crafts, science, cooking, etc. Assisting classroom teachers with general classroom management Assisting with general classroom maintenance and cleaning Assisting with lunch routine (set-up, serving, and clean-up with children) Supervision The CMS supervisor/ principal is responsible for the supervision of students and volunteers, and will assign daily supervision and responsibilities to a mentoring teacher. Expectations of the mentoring teacher: must clearly explain what is expected of the student/volunteer during their placement. must treat students/volunteers treated in the same way, and will receive the same level of support as paid staff members. Student and staff will be provided with the same conditions of work, respect and opportunities to develop skills. must never leave children unattended with a student/ volunteer. must not include the student/volunteers to uphold ratios. must ensure that students/volunteers remain in sight while working with children. must be able and willing to offer the necessary level of support to ensure a successful placement. must introduce students/volunteers to parents.This policy will be reviewed by staff, students and volunteers before they begin their employment at CMS, and annually thereafter, or at any time a revision occurs. A record of this review will be signed and dated by the person who participated and conducted the review and will be kept for a minimum of 3 years.",
    "keywords": [
      "student",
      "volunteer",
      "supervision",
      "ratio",
      "Vulnerable Sector Check",
      "policy review",
      "prohibited practices",
      "anaphylaxis",
      "confidentiality",
      "mentoring teacher",
      "identification"
    ]
  },
  {
    "id": "waiting_list",
    "title": "Waiting List Policy & Procedures",
    "content": "CMS does not charge any fee to place a child on the waiting list. Priority goes to transfers within CMS, siblings of current students, and children of CMS employees. Families must submit a completed admission form to be added. Waiting list information is private—parents may ask about their child's position but other names are concealed. Admission is first-come-first-served based on the date of placement. Once a spot is confirmed, a non-refundable $500 registration fee is required. Review records kept for minimum 3 years.Waiting List Policy & Procedures Central Montessori Schools (CMS) does not charge or collect a fee for the placement of a child on a school waiting list for admission at any of our locations. Priority shall be given to transfers from other CMS locations, siblings of existing students, and children of CMS employees. In order to be placed on a waiting list, families must provide a completed admission form, signed on the day the child will be placed on the list. All information collected will be private and confidential, only to be used for admission purposes by school administrators. The information on the waiting list will be available in a manner that maintains the privacy of children listed on it, and information will be given to parents/guardians of the position of a child on the list upon request. Visible information on other children and their families will be  physically concealed (using pieces of blank paper to cover the names of others that come on the list before and after the child in question), but the position on the waiting list of a child being inquired about will be ascertained by their parents/guardians. Upon availability of placement, admission from the waiting list is determined on a first come-first serve basis, according to the date on the application/ day the child was placed on the list. Once placement can be secured, a non-refundable, one-time registration fee of $500 is payable to CMS. This policy will be reviewed by staff, students and volunteers before they begin their employment at CMS, and annually thereafter, or at any time a revision occurs. A record of this review will be signed and dated by the person who participated and conducted the review and will be kept for a minimum of 3 years.",
    "keywords": [
      "waiting list",
      "admission",
      "priority",
      "siblings",
      "CMS employees",
      "registration fee",
      "privacy",
      "placement",
      "first come first serve"
    ]
  },
  {
    "id": "staff_development",
    "title": "Staff Development & Training Policy",
    "content": "All new staff, students, and volunteers receive mandatory orientation covering CMS policies, Public Health, Fire Safety, and Ministry requirements. Supervisors/principals meet with staff monthly to identify training needs. CMS offers mandatory and optional workshops. Only one staff per classroom may attend training during program hours unless approved otherwise. All staff must complete and maintain Standard First Aid with CPR Level C; CMS covers part of the annual refresher. Professional development may include workshops, webinars, meetings, observations, articles, and updated Ministry requirements. Staff Development and Training Policy POLICY STATEMENT: Central Montessori School (CMS) is committed to providing high quality child care through ongoing professional staff training and development. We believe that the quality of the program depends on staff having knowledge of current theories in brain/child development and practices in the Montessori/Early Childhood Profession. Professional development is a joint responsibility of staff and administration. We also encourage staff to engage in their own professional development ourside of work. DEFINITIONS: Professional Development and Training refers to all opportunities for advancement and learning that are planned for both in-house and outside the school. These may include workshops, conferences, webinars, events, observations, reading of articles, books and current studies, or meetings/programs that reflect changes within the Ministry of Education and Childcare Quality Assurance and Licensing, as well as topics relating to brain development, child physical/ social/ emotional, cognition and pedagogy. Orientation  refers to job specific policy review and training of new staff, students and volunteers. IMPLEMENTATION AND GUIDELINES: Every new staff member, student or volunteer working at CMS shall participate in an official Orientation to receive training,  information and documents on up-to-date policies and procedure relating to CMS guidelines, Public Health, Fire Safety, Ministry of Education/Childcare Quality Assurance and Licensing. It is the responsibility of the authorized Supervisor, or Principal, to meet with classroom staff monthly to discuss and suggest areas that need to be improved through further development/ training of the program or staff members whom may benefit from either in-school training or self-directed reading or observing to appropriate settings. All CMS staff are eligible for mandatory and optional training and workshops offered by (or through) the school. To maintain proper supervision and provide quality care for children, only one staff from each classroom shall participate in development and training at a time during program hours, unless approval has been granted by the Head of School. All staff members are required to attend regular staff meetings in which: Resources, skills, ideas, professional experiences and expertise are shared. Review current and new policies and procedure of CMS, Ministry of Education/ Childcare Quality Assurance and Licensing. Staff decision are made with regards to upcoming school events and occasions. FIRST AID AND CPR All staff who work at CMS must complete and maintain Standard First Aid with level C CPR (infant, child, and adult). A mandatory refresher course is provided each school year. CMS will cover half of the cost of this course.",
    "keywords": [
      "training",
      "orientation",
      "professional development",
      "workshops",
      "First Aid",
      "CPR Level C",
      "monthly meetings",
      "policies",
      "staff development"
    ]
  }
]